SET client_encoding TO 'UTF8';

INSERT INTO dormitory (dormitory_id, name, postal_code, address, region, layout_type, gender_type, nearest_station_1, nearest_station_2, nearest_station_3, remarks, created_at, updated_at) VALUES
    ('D006', '青砥A寮', '1250062', '東京都葛飾区青戸3-11-2-615', 'TOKYO', '3DK', 'MALE', '青砥駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D007', '大阪B寮', '5360025', '大阪府大阪市城東区森之宮１丁目UR森之宮団地4号棟−619', 'OSAKA', '3DK', 'MALE', '森ノ宮駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D008', '大阪C寮', '5360025', '大阪府大阪市城東区森之宮１丁目UR森之宮第一団地1号棟−1110', 'OSAKA', '3DK', 'MALE', '森ノ宮駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D009', '大阪D寮', '5360025', '大阪府大阪市城東区森之宮２丁目UR森之宮第二団地9号棟−1807', 'OSAKA', '3DK', 'MALE', '森ノ宮駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D010', '豊洲C寮', '1350061', '東京都江東区豊洲４－１０－４号棟－８０２', 'TOKYO', '3DK', 'MALE', '豊洲駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D011', '豊洲D寮', '1350061', '東京都江東区豊洲４－１０－４号棟－９１０', 'TOKYO', '3DK', 'MALE', '豊洲駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D012', '豊洲H寮', '1350061', '東京都江東区豊洲４－１０－４号棟－１３０６', 'TOKYO', '3DK', 'MALE', '豊洲駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D013', '豊洲Ｉ寮', '1350061', '東京都江東区豊洲４－１０－４号棟－３０８', 'TOKYO', '3DK', 'MALE', '豊洲駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D014', '大島C寮', '1360072', '東京都江東区大島6-1-5号棟519号室', 'TOKYO', '3DK', 'MALE', '大島駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D015', '大島D寮', '1360072', '東京都江東区大島6-1-5号棟1204号室', 'TOKYO', '3DK', 'MALE', '大島駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D016', '大島E寮', '1360072', '東京都江東区大島6-1-5号棟626号室', 'TOKYO', '3DK', 'MALE', '大島駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D017', '大島F寮', '1360072', '東京都江東区大島6-1-5号棟1401号室', 'TOKYO', '3DK', 'MALE', '大島駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D018', '大島G寮', '1360072', '東京都江東区大島6-1-5号棟1335号室', 'TOKYO', '3DK', 'MALE', '大島駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09'),
    ('D019', '大島H寮', '1360072', '東京都江東区大島6-1-5号棟416号室', 'TOKYO', '3DK', 'MALE', '大島駅', NULL, NULL, 'サンプルExcel由来', '2024-01-01 09:00:00+09', '2024-01-01 09:00:00+09')
ON CONFLICT (dormitory_id) DO NOTHING;
